In [1]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import datetime

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

As you know, it's important to gain an understanding of new datasets before diving headlong into analysis. Here are some suggestions for guiding the process of getting to know the data contained in these tables:
- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [4]:
query = '''
SELECT COUNT(*)
FROM scooters
WHERE chargelevel IS NULL
'''

result = engine.execute(query)

In [ ]:
result.fetchall()

scooters: chargelevel has 770 nulls.

In [ ]:
query = '''
SELECT MAX(tripduration),MIN(tripduration ) 
FROM trips
'''

result = engine.execute(query)

In [ ]:
result.fetchall()

In [ ]:
query = '''
SELECT MAX(tripdistance),MIN(tripdistance) 
FROM trips
'''

result = engine.execute(query)

In [ ]:
result.fetchall()

In [ ]:
query = '''
SELECT pubdatetime
FROM scooters
LIMIT 2
'''

result = engine.execute(query)

In [ ]:
result.fetchall()
pd.read_sql(query, con = engine)

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [ ]:
scooter_count = '''
SELECT DISTINCT companyname, COUNT(DISTINCT(sumdid))
FROM scooters
GROUP BY companyname;
'''

In [ ]:
pd.read_sql(scooter_count, con = engine)

In [ ]:
scooter_count = '''
SELECT DISTINCT companyname, COUNT(DISTINCT(sumdid)), EXTRACT(MONTH FROM pubdatetime) as month
FROM scooters
GROUP BY companyname, month;
'''

In [ ]:
pd.read_sql(scooter_count, con = engine)

In [ ]:
scooter_count_distance = '''
SELECT DISTINCT companyname, SUM(tripduration)
FROM trips
GROUP BY companyname;
'''

In [ ]:
pd.read_sql(scooter_count_distance, con = engine)

In [13]:
scooter_use =  '''
SELECT companyname, ROUND(SUM(tripduration), 2) AS sum_trip
FROM trips
GROUP BY companyname'''
sumd_usage_in_min = pd.read_sql(scooter_use, con = engine, index_col='companyname')
print(sumd_usage_in_min)

                  sum_trip
companyname
Bird            2046202.00
Bolt Mobility  30821497.00
Gotcha            33802.78
JUMP             211001.30
Lime            3507335.40
Lyft            1936369.53
SPIN             900575.00

In [14]:
sumd_uage_pd = (sumd_usage_in_min['sum_trip']/60).round(2)
print(sumd_uage_pd)

companyname
Bird              34103.37
Bolt Mobility    513691.62
Gotcha              563.38
JUMP               3516.69
Lime              58455.59
Lyft              32272.83
SPIN              15009.58
Name: sum_trip, dtype: float64

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

In [27]:
query = '''
SELECT tripduration
FROM trips
'''
pd.read_sql(query, con = engine)

        tripduration
0           3.000000
1           1.715600
2           3.000000
3           3.000000
4           2.000000
...              ...
565517     17.497950
565518      3.154917
565519     18.440650
565520    142.345610
565521    209.409650

[565522 rows x 1 columns]

In [16]:
query = '''
SELECT tripduration
FROM trips
WHERE tripduration > 1
'''
pd.read_sql(query, con = engine)

        tripduration
0           3.000000
1           1.715600
2           3.000000
3           3.000000
4           2.000000
...              ...
548977     17.497950
548978      3.154917
548979     18.440650
548980    142.345610
548981    209.409650

[548982 rows x 1 columns]

In [32]:
query = '''
SELECT MAX(endtime)
FROM trips
'''
pd.read_sql(query, con = engine)

               max
0  23:59:59.310000

They were not in full compliance with the cleaning requirements.

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?

5. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.